app/views/recipes/my_recipes.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---

      <% @user.recipes.each do |recipe| %>