app/views/recipes/show.html.erb

            <div class="recipes__username">
              <%= User.find(review.user_id).username %>:
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]