app/views/recipes/show.html.erb


        <% @recipe.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 6]]