app/views/users/show.html.erb

    <h2>Your Recipes</h2>
    <% @user.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 10]]