app/views/users/favourites/favourites.html.erb

SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = $1  [["user_id", 11]]
---
    <h2>Your Favourite Recipes</h2>
    <% @user.favourites.each do |favourite| %>