app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.find_by(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def existing_account
    @existing_account = User.find_by(email: params[:email])