app/controllers/favourites_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "favourites".* FROM "favourites" WHERE "favourites"."recipe_id" = $1 AND "favourites"."user_id" = $2 LIMIT $3  [["recipe_id", 1], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "favourites" ("recipe_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 9], ["created_at", "2023-09-04 23:22:59.910844"], ["updated_at", "2023-09-04 23:22:59.910844"], ["user_id", 1]]
---
    def create
      @recipe = Recipe.find(params[:recipe_id])
      @existing_favorite = @recipe.favourites.find_by(user_id: current_user.id)

      if @existing_favorite
        flash[:notice] = 'This recipe is already in your favorites.'
      else
        @favourite = @recipe.favourites.build(user_id: current_user.id)

        if @favourite.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "favourites".* FROM "favourites" WHERE "favourites"."recipe_id" = $1 AND "favourites"."user_id" = $2 LIMIT $3  [["recipe_id", 2], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "favourites" WHERE "favourites"."id" = $1  [["id", 12]]
---
  def destroy
    @recipe = Recipe.find(params[:recipe_id])
    @favourite = @recipe.favourites.find_by(user_id: current_user.id)

    if @favourite
      @favourite.destroy