app/controllers/recipes_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 1]]
---
  def show
    @recipe = Recipe.find(params[:id])
    @reviews = @recipe.reviews if @recipe.present?