app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def index
    if request.post?
      @recipes = Recipe.apply_boolean_filters(filter_params)
    else
      @recipes = Recipe.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "favourites".* FROM "favourites" WHERE "favourites"."recipe_id" = $1 AND "favourites"."user_id" = $2 LIMIT $3  [["recipe_id", 7], ["user_id", 1], ["LIMIT", 1]]
---
  def show
    @recipe = Recipe.find(params[:id])
    @existing_favorite = @recipe.favourites.find_by(user_id: current_user.id)

INSERT INTO "recipes" ("title", "gluten_free", "vegan", "vegetarian", "breakfast", "kosher", "peanut_free", "halal", "dinner", "lunch", "dessert", "appetizer", "photo", "time", "number_of_servings", "instructions", "country", "description", "user_id", "created_at", "updated_at", "ingredients") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
---
  def create
    @recipe = current_user.recipes.new(recipe_params)
    if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @recipe = Recipe.find(params[:id])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "recipes" SET "vegetarian" = $1, "photo" = $2, "updated_at" = $3 WHERE "recipes"."id" = $4  [["vegetarian", true], ["photo", "#<ActionDispatch::Http::UploadedFile:0x00000001087a5720>"], ["updated_at", "2023-09-04 23:47:26.656787"], ["id", 11]]
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
DELETE FROM "favourites" WHERE "favourites"."id" = $1  [["id", 1]]
---
  def destroy
    @recipe = Recipe.find(params[:id])

    @recipe.reviews.destroy_all
    @recipe.favourites.destroy_all

    if @recipe.destroy