app/controllers/registrations_controller.rb

INSERT INTO "users" ("name", "email", "username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    if existing_account
      redirect_to login_path, alert: 'Invalid credentials. Please login or use a different email.'
    else
      @user = User.new(user_params)
      if @user.save