app/controllers/users_controller.rb

  def favourites
     if !current_user
      redirect_to login_path, alert: 'Please login.'
    else
        @favourites = Favourite.where(user_id: current_user.id)
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = $1  [["user_id", 11]]

  def show
    if !current_user
      redirect_to login_path, alert: 'Please login.'
    else
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def edit
    if !current_user
      redirect_to login_path, alert: 'Please login.'
    else
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    if !current_user
      redirect_to login_path, alert: 'Please log in to update your profile.'
    else
      @user = User.find(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "password_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-08-29 20:11:23.289773"], ["password_digest", "$2a$12$40iVUYSNwSZwIDE1PwCRJOvoW04M/o0LwYaGjYcNjKGxNHV2zLkA2"], ["id", 12]]

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 14]]